nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/driver_examples/lpspi/interrupt/pin_mux.c
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXE247
package_id: MCXE247VLQ
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: '55', pin_signal: PTD8/LPI2C1_SDA/MII_RXD3/FTM2_FLT2/FXIO_D1/FTM1_CH4/QSPI_B_IO5, label: I2C1_SDA, identifier: I2C1_SDA}
- {pin_num: '54', pin_signal: PTD9/LPI2C1_SCL/FXIO_D0/MII_RXD2/FTM1_CH5/QSPI_B_IO4, label: I2C1_SCL, identifier: I2C1_SCL}
- {pin_num: '121', pin_signal: PTE6/LPSPI0_PCS2/FTM7_FLT1/FTM3_CH7/LPUART1_RTS/ADC1_SE11, label: LPSPI0_PCS2, identifier: LPSPI0_PCS2}
- {pin_num: '63', pin_signal: PTB3/FTM1_CH1/LPSPI0_SIN/FTM1_QD_PHA/TRGMUX_IN2/ADC0_SE7, label: LPSPI0_SIN, identifier: LPSPI0_SIN}
- {pin_num: '122', pin_signal: PTE2/LPSPI0_SOUT/LPTMR0_ALT3/FTM3_CH6/LPUART1_CTS/SAI1_SYNC/ADC1_SE10, label: LPSPI0_SOUT, identifier: LPSPI0_SOUT}
- {pin_num: '138', pin_signal: PTE0/LPSPI0_SCK/TCLK1/LPI2C1_SDA/LPSPI1_SOUT/FTM1_FLT2/SAI0_D2, label: LPSPI0_SCK, identifier: LPSPI0_SCK}
- {pin_num: '1', pin_signal: PTE16/LPUART1_RTS/LPSPI2_SIN/FTM2_CH7/FTM4_FLT0/FXIO_D3/TRGMUX_OUT7, label: LPSPI2_SIN, identifier: LPSPI2_SIN}
- {pin_num: '144', pin_signal: PTA8/LPUART2_RX/LPSPI2_SOUT/FXIO_D6/FTM4_FLT1, label: LPSPI2_SOUT, identifier: LPSPI2_SOUT}
- {pin_num: '59', pin_signal: PTC15/FTM1_CH3/LPSPI2_SCK/MII_CRS/QSPI_B_CS/ADC0_SE13, label: LPSPI2_SCK, identifier: LPSPI2_SCK}
- {pin_num: '6', pin_signal: PTE10/CLKOUT/LPSPI2_PCS1/FTM2_CH4/FXIO_D4/TRGMUX_OUT4, label: LPSPI2_PCS1, identifier: LPSPI2_PCS1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitSPIPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '25', peripheral: LPUART2, signal: RX, pin_signal: PTD17/FTM0_FLT2/LPUART2_RX/FTM5_FLT1}
  - {pin_num: '23', peripheral: LPUART2, signal: TX, pin_signal: PTE12/LPUART2_TX/FTM5_FLT0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTD17 (pin 25) is configured as LPUART2_RX */
    PORT_SetPinMux(PORTD, 17U, kPORT_MuxAlt3);

    /* PORTE12 (pin 23) is configured as LPUART2_TX */
    PORT_SetPinMux(PORTE, 12U, kPORT_MuxAlt3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: '121', peripheral: LPSPI0, signal: PCS2, pin_signal: PTE6/LPSPI0_PCS2/FTM7_FLT1/FTM3_CH7/LPUART1_RTS/ADC1_SE11, direction: INPUT, drive_strength: low,
    pull_select: down, pull_enable: disable, passive_filter: disable, digital_filter: disable}
  - {pin_num: '63', peripheral: LPSPI0, signal: IN, pin_signal: PTB3/FTM1_CH1/LPSPI0_SIN/FTM1_QD_PHA/TRGMUX_IN2/ADC0_SE7, direction: INPUT, drive_strength: low, pull_select: down,
    pull_enable: disable, passive_filter: disable, digital_filter: disable}
  - {pin_num: '122', peripheral: LPSPI0, signal: OUT, pin_signal: PTE2/LPSPI0_SOUT/LPTMR0_ALT3/FTM3_CH6/LPUART1_CTS/SAI1_SYNC/ADC1_SE10, direction: INPUT, drive_strength: low,
    pull_select: down, pull_enable: disable, passive_filter: disable, digital_filter: disable}
  - {pin_num: '138', peripheral: LPSPI0, signal: SCK, pin_signal: PTE0/LPSPI0_SCK/TCLK1/LPI2C1_SDA/LPSPI1_SOUT/FTM1_FLT2/SAI0_D2, direction: INPUT, drive_strength: low,
    pull_select: down, pull_enable: disable, passive_filter: disable, digital_filter: disable}
  - {pin_num: '1', peripheral: LPSPI2, signal: IN, pin_signal: PTE16/LPUART1_RTS/LPSPI2_SIN/FTM2_CH7/FTM4_FLT0/FXIO_D3/TRGMUX_OUT7, direction: INPUT, drive_strength: low,
    pull_select: down, pull_enable: disable, passive_filter: disable, digital_filter: disable}
  - {pin_num: '144', peripheral: LPSPI2, signal: OUT, pin_signal: PTA8/LPUART2_RX/LPSPI2_SOUT/FXIO_D6/FTM4_FLT1, direction: INPUT, drive_strength: low, pull_select: down,
    pull_enable: disable, passive_filter: disable, digital_filter: disable}
  - {pin_num: '59', peripheral: LPSPI2, signal: SCK, pin_signal: PTC15/FTM1_CH3/LPSPI2_SCK/MII_CRS/QSPI_B_CS/ADC0_SE13, direction: INPUT, drive_strength: low, pull_select: down,
    pull_enable: disable, passive_filter: disable, digital_filter: disable}
  - {pin_num: '6', peripheral: LPSPI2, signal: PCS1, pin_signal: PTE10/CLKOUT/LPSPI2_PCS1/FTM2_CH4/FXIO_D4/TRGMUX_OUT4, direction: INPUT, drive_strength: low, pull_select: down,
    pull_enable: disable, passive_filter: disable, digital_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPIPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port A */
        PORTA,
        /* Digital filter is configured for PORTA0 */
        PORT_DFER_DFE_8_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t LPSPI2_SOUT = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as LPSPI2_SOUT */
                                           kPORT_MuxAlt3,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTA8 (pin 144) is configured as LPSPI2_SOUT */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI2_SOUT_PORT, BOARD_INITSPIPINS_LPSPI2_SOUT_PIN, &LPSPI2_SOUT);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port B */
        PORTB,
        /* Digital filter is configured for PORTB0 */
        PORT_DFER_DFE_3_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t LPSPI0_SIN = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI0_SIN */
                                          kPORT_MuxAlt3,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTB3 (pin 63) is configured as LPSPI0_SIN */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SIN_PORT, BOARD_INITSPIPINS_LPSPI0_SIN_PIN, &LPSPI0_SIN);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port C */
        PORTC,
        /* Digital filter is configured for PORTC0 */
        PORT_DFER_DFE_15_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t LPSPI2_SCK = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI2_SCK */
                                          kPORT_MuxAlt3,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTC15 (pin 59) is configured as LPSPI2_SCK */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI2_SCK_PORT, BOARD_INITSPIPINS_LPSPI2_SCK_PIN, &LPSPI2_SCK);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port E */
        PORTE,
        /* Digital filter is configured for PORTE0 */
          PORT_DFER_DFE_0_MASK
            /* Digital filter is configured for PORTE1 */
            | PORT_DFER_DFE_2_MASK
            /* Digital filter is configured for PORTE2 */
            | PORT_DFER_DFE_6_MASK
            /* Digital filter is configured for PORTE3 */
            | PORT_DFER_DFE_10_MASK
            /* Digital filter is configured for PORTE4 */
            | PORT_DFER_DFE_16_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t LPSPI0_SCK = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI0_SCK */
                                          kPORT_MuxAlt2,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTE0 (pin 138) is configured as LPSPI0_SCK */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SCK_PORT, BOARD_INITSPIPINS_LPSPI0_SCK_PIN, &LPSPI0_SCK);

    const port_pin_config_t LPSPI2_PCS1 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as LPSPI2_PCS1 */
                                           kPORT_MuxAlt3,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE10 (pin 6) is configured as LPSPI2_PCS1 */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI2_PCS1_PORT, BOARD_INITSPIPINS_LPSPI2_PCS1_PIN, &LPSPI2_PCS1);

    const port_pin_config_t LPSPI2_SIN = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI2_SIN */
                                          kPORT_MuxAlt3,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTE16 (pin 1) is configured as LPSPI2_SIN */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI2_SIN_PORT, BOARD_INITSPIPINS_LPSPI2_SIN_PIN, &LPSPI2_SIN);

    const port_pin_config_t LPSPI0_SOUT = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as LPSPI0_SOUT */
                                           kPORT_MuxAlt2,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE2 (pin 122) is configured as LPSPI0_SOUT */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SOUT_PORT, BOARD_INITSPIPINS_LPSPI0_SOUT_PIN, &LPSPI0_SOUT);

    const port_pin_config_t LPSPI0_PCS2 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as LPSPI0_PCS2 */
                                           kPORT_MuxAlt2,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE6 (pin 121) is configured as LPSPI0_PCS2 */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_PCS2_PORT, BOARD_INITSPIPINS_LPSPI0_PCS2_PIN, &LPSPI0_PCS2);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
